{
  "level1": {
    "e1": "The command ls prints out current working directory and the files within it.\nls has many options that will list different files, directories, and information.\nBelow are the options listed with what each option ( IE ls -a, ls -f) does.\n\n\nOPTIONS\n-l long format, displaying Unix file types, permissions, number of hard links,\n owner, group, size, last-modified date and filename\n-f do not sort. Useful for directories containing large numbers of files.\n-F appends a character revealing the nature of a file, for example,\n * for an executable, or / for a directory. Regular files have no suffix.\n-a lists all files in the given directory, including those whose names start\nwith \".\" (which are hidden files in Unix). By default, these files are excluded\n from the list.\n-R recursively lists subdirectories. The command ls -R / would therefore list\n all files.\n-d shows information about a symbolic link or directory, rather than about the\n link's target or listing the contents of a directory.\n-t sort the list of files by modification time\n-h print sizes in human readable format. (e.g., 1K, 234M, 2G, etc.) This option is not part of the POSIX standard, although implemented in several systems,\ne.g., GNU coreutils in 1997,FreeBSD 4.5 in 2002,and Solaris 9 in 2002.",
    "e2": "-1 (the numeric digit one) force output to be one entry per line.",
    "e3": "The cd command, allows you to change your directory when working in your terminal.\nBelow are a few way you can use the cd command to your benefit.\n\n\nOPTIONS \n- cd by itself or cd ~ will always put you in your home directory.\n- cd . will leave you in the same directory you are currently in (i.e.,\n your current directory won't change). This can be useful if your shell's\n internal code can't deal with the directory you are in being recreated; running cd . will place your shell in the recreated directory.\n-cd ~username will put you in username's home directory. ",
    "e4": "level 1 e4\nline2",
    "e5": "level 1 e5\nline2",
    "e6": "level 1 e6\nline2",
    "e7": "level 1 e7\nline2",
    "e8": "level 1 e8\nline2",
    "e9": "level 1 e9\nline2",
    "e10": "level 1 e10\nline2"
  },
  "level2": {
    "e1": "level 1 e1\nline2",
    "e2": "level 1 e2\nline2",
    "e3": "level 1 e3\nline2",
    "e4": "level 1 e4\nline2",
    "e5": "level 1 e5\nline2",
    "e6": "level 1 e6\nline2",
    "e7": "level 1 e7\nline2",
    "e8": "level 1 e8\nline2",
    "e9": "level 1 e9\nline2",
    "e10": "level 1 e10\nline2"
  },
  "level3": {
    "e1": "level 1 e1\nline2",
    "e2": "level 1 e2\nline2",
    "e3": "level 1 e3\nline2",
    "e4": "level 1 e4\nline2",
    "e5": "level 1 e5\nline2",
    "e6": "level 1 e6\nline2",
    "e7": "level 1 e7\nline2",
    "e8": "level 1 e8\nline2",
    "e9": "level 1 e9\nline2",
    "e10": "level 1 e10\nline2"
  }
}