{
  "level1": {
    "e1": "The command ls prints out current working directory and the files within it.\nls has many options that will list different files, directories, and information.\nBelow are the options listed with what each option ( IE ls -a, ls -f) does.\n\n\nOPTIONS\n-l long format, displaying Unix file types, permissions, number of hard links, owner, group, size, last-modified date and filename \n-f do not sort. Useful for directories containing large numbers of files.\n-F appends a character revealing the nature of a file, for example, * for an executable, or / for a directory. Regular files have no suffix.\n-a lists all files in the given directory, including those whose names startwith \".\" (which are hidden files in Unix). By default, these files are excludedfrom the list.\n-R recursively lists subdirectories. The command ls -R / would therefore list all files.\n-d shows information about a symbolic link or directory, rather than about the link's target or listing the contents of a directory.\n-t sort the list of files by modification time\n-h print sizes in human readable format. (e.g., 1K, 234M, 2G, etc.) This option is not part of the POSIX standard, although implemented in several systems,e.g., GNU coreutils in 1997,FreeBSD 4.5 in 2002,and Solaris 9 in 2002.",
    "e2": "-1 (the numeric digit one) force output to be one entry per line.",
    "e3": "The cd command, allows you to change your directory when working in your terminal.\nBelow are a few way you can use the cd command to your benefit.\n\n\nOPTIONS \n- cd by itself or cd ~ will always put you in your home directory.\n- cd . will leave you in the same directory you are currently in (i.e. your current directory won't change). This can be useful if your shell's internal code can't deal with the directory you are in being recreated; running cd . will place your shell in the recreated directory.\n-cd ~username will put you in username's home directory. ",
    "e4": "-cd dir (without a /) will put you in a subdirectory; for example, if you are in /usr, typing cd bin will put you in /usr/bin, while cd /bin puts you in /bin.\n\n-cd .. will move you up one directory. So, if you are /usr/bin/tmp, cd .. moves you to /usr/bin, while cd ../.. moves you to /usr (i.e. up two levels). You can use this indirection to access subdirectories too. So, from /usr/bin/tmp, you can use cd ../../local to go to /usr/local.\n\n-cd - will switch you to the previous directory. For example, if you are in /usr/bin/tmp, and go to /etc, you can type cd - to go back to /usr/bin/tmp. You can use this to toggle back and forth between two directories.",
    "e5": "-This environment variable \"prints\" write your current working directory in standard output.\n-This command is helpful when needing path names or if you are lost in the directory.\n-Comes in hand with ls (another command) to help you move along within the directory.",
    "e6": "Options for cd\n\npwd -P, this option will print your physical working path\npwd -L, this option will print your logical working path  ",
    "e7": "-uname is a command that will output the name, version, and other information about the current machine in use and its OS.\n-An option for uname is uname -a which will output in the following format (Kernel name, network node hostname, kernel release date, kernel version, machine hardware name, hardware platform, operating system)",
    "e8": "Other options for uname are as follows.\n\n-s prints the kernel name\n-n option: It prints the hostname of the network node (current computer)\n-r option: It prints the kernel release date.\n-v option: It prints the version of the current kernel.\n-m option: It prints the machine hardware name.\n-p option: It prints the type of the processor\n-i option: It prints the platform of the hardware.\n-o option: It prints the name of the operating system.",
    "e9": "sudo (Super User DO) command in Linux is generally used as a prefix of some command that only superuser are allowed to run. If you prefix \"sudo\" with any command, it will run that command with elevated privileges or in other words allow a user with proper permissions to execute a command as another user, such as the superuser. This is the equivalent of \"run as administrator\" option in Windows. The option of sudo lets us have multiple administrators.These users who can use the sudo command need to have an entry in the sudoers file located at \"/etc/sudoers\". Remember that to edit or view the sudoers file you have to use sudo command. To edit the sudoers file it is recommended to use \"visudo\" command. By default, sudo requires that users authenticate themselves with a password which is the user's password, not the root password itself.\n\n\nsudo has 15 different options when using the command here are a few of them and how they interact with your terminal.\n\n1. -V: The -V (version) option causes sudo to print the version number and exit. If the invoking user is already root, the -V option will print out a list of the defaults sudo was compiled with.\n2. -l: The -l (list) option will print out the commands allowed (and forbidden) the user on the current host.\n3. -h or –help: The -h (help) option causes sudo to print a usage message and exit.\n4. -v: If, given the -v (validate) option, sudo will update the user's timestamp, prompting for the user's password if necessary. This extends the sudo timeout for another 5 minutes (or as given in sudoers) but does not run a command. This does not give any output.\n5. -k: The -k (kill) option to sudo invalidates the user's timestamp.So, the next time sudo is run a password will be required. This option does not require a password and was added to allow a user to revoke sudo permissions from a .logout file.\n6. -K: Similar to the -k option, the -K (sure kill) option is used to remove the user's timestamp entirely. Likewise, this option does not require a password.\n7. -b: The -b (background) option tells sudo to run the given command in the background. Note that if you use the -b option you cannot use shell job control to manipulate the process.",
    "e10": "Continuation of the options for sudo\n\n\n8. -p:The -p (prompt) option allows you to override the default password prompt and use a custom one. The following percent ('%') escapes are supported: %u is expanded to the invoking user's login name; %U is expanded to the login name of the user the command will be run as (which defaults to root); %h is expanded to the local hostname without the domain name; %H is expanded to the local hostname including the domain name (only if the machine's hostname is fully qualified or the \"fqdn\" sudoers option is set); %% (two consecutive % characters) are collapsed into a single % character.\n9. -n: Use -n option as shown below, which will execute the command without prompting for the password. This is very helpful when we want to run some of the sudo commands as background jobs (or in a shell script), where we don’t want sudo to ask for the password. -n option stands for non-interactive.\n10. -u: The -u (user) option causes sudo to run the specified command as a user other than root. To specify a uid instead of a username, use #uid.\n11. -s: The -s (shell) option runs the shell specified by the SHELL environment variable if it is set or the shell as specified in the file passwd.\n12. -H: The -H (HOME) option sets the HOME environment variable to the home directory of the target user (root by default) as specified in passwd. By default, sudo does not modify HOME.\n13. -S: The -S (stdin) option causes sudo to read the password from standard input instead of the terminal device.\n14. -a: The -a (authentication type) option causes sudo to use the specified authentication type when validating the user, as allowed by /etc/login.conf. The system administrator may specify a list of sudo-specific authentication methods by adding an \"auth-sudo\" entry in /etc/login.conf.\n15. -: The - flag indicates that sudo should stop processing command line arguments. It is most useful in conjunction with the -s flag."
  },
  "level2": {
    "e1": "level 1 e1\nline2",
    "e2": "level 1 e2\nline2",
    "e3": "level 1 e3\nline2",
    "e4": "level 1 e4\nline2",
    "e5": "level 1 e5\nline2",
    "e6": "level 1 e6\nline2",
    "e7": "level 1 e7\nline2",
    "e8": "level 1 e8\nline2",
    "e9": "level 1 e9\nline2",
    "e10": "level 1 e10\nline2"
  },
  "level3": {
    "e1": "level 1 e1\nline2",
    "e2": "level 1 e2\nline2",
    "e3": "level 1 e3\nline2",
    "e4": "level 1 e4\nline2",
    "e5": "level 1 e5\nline2",
    "e6": "level 1 e6\nline2",
    "e7": "level 1 e7\nline2",
    "e8": "level 1 e8\nline2",
    "e9": "level 1 e9\nline2",
    "e10": "level 1 e10\nline2"
  }
}